### Step 1. 필요한 라이브러리 임포트

In [1]:
import pandas as pd

### Step 2. [데이터](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv) 확인  

나라별 알콜(맥주, 증류주, 와인) 소비량 데이터

### Step 3. 데이터 불러오기


**read_csv를 통해 데이터를 올바른 형태로 불러온 뒤 drinks 저장해주세요**  
data : drinks.csv

In [2]:
drinks  = pd.read_csv('C:/STUDY/StudyPandas/data/drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. 어느 대륙(continent)이 평균 맥주 소모량이 가장 높은가요?

EU

In [133]:
drinks

Empty DataFrame
Columns: [continent, mean_continent]
Index: []

### Step 5. 각 대륙(continent)별 와인 소모 통계값 계산해주세요

count, mean,std, min, max값은 'describe'를 통해 한번에 조회할 수 있습니다

groupby후 describe를 적용해보세요

  continent  count_continent
0        AF               53
1        AS               44
2        EU               45
3        OC               16
4        SA               12

### Step 6. 평균 알코올 소비량을 대륙별로 조회해주세요

Hint: 대륙별로 모든 column에 대하여 평균값을 구해주세요

  continent  mean_continent
0        AF        3.007547
1        AS        2.170455
2        EU        8.617778
3        OC        3.381250
4        SA        6.308333

### Step 7. 알코올 소비량 중간값을 대륙별로 조회해주세요

Hint: 대륙별로 모든 column에 대하여 중간값을 구해주세요

중간값은 .median()으로 구합니다

  continent  median_continent
0        AF              2.30
1        AS              1.20
2        EU             10.00
3        OC              1.75
4        SA              6.85

### Step 8. 증류주(spirit) 소비량의 평균, 최소, 최대값을 구해주세요

Hint: groupby와 agg 함수를 사용하여 한번에 표현해주세요

### Step 9. 대륙별 맥주 소비량의 평균을 Bar 그래프로 표현해주세요